Repository: bluepayment-plugin/bluemedia-payment-gateway-for-woocommerce
Catalog: i18n/languages/bluepayment-gateway-for-woocommerce-*.po
Languages: pl_pl

source: Blue Media Online Payment System for WooCommerce requiresWooCommerce version 2.1 or higher. Please backup your site files and database, update WooCommerce, and try again.
pl_pl: System płatności internetowych Blue Media dla WooCommerce wymaga WooCommerce w wersji 2.1 lub wyższej. Utwórz kopię zapasową plików witryny i bazy danych, zaktualizuj WooCommerce i spróbuj ponownie.

source: This plugin requires <a href="http://php.net/manual/en/book.xmlwriter.php">XMLWriter</a>
pl_pl: Ten plugin wymaga rozszerzenia <a href="http://php.net/manual/en/book.xmlwriter.php">XMLWriter</a>

source: This plugin requires <a href="http://php.net/manual/en/book.xmlreader.php">XMLReader</a>
pl_pl: Ten plugin wymaga rozszerzenia <a href="http://php.net/manual/en/book.xmlreader.php">XMLReader</a>

source: Configuration
pl_pl: Konfiguracja

source: Help
pl_pl: Pomoc

source: Logs
pl_pl: Logi

source: WooCommerce Blue Media Online Payment System requires that the <a href="%s">Force secure checkout</a> option is enabled; your checkout may not be secure! Please enable SSL and ensure your server has a valid SSL certificate. | <a href="%s">%s</a>
pl_pl: System płatności online WooCommerce Blue Media wymaga włączenia opcji <a href="%s">Force secure checkout</a>. Twoje płatności mogą nie być bezpieczne! Włącz proszę obsługę SSL oraz upewnij się, że Twój serwer ma zainstalowany poprawny certyfikat SSL. | <a href="%s">%s</a>

source: Hide this notice
pl_pl: Ukryj

source: WooCommerce Blue Media Online Payment System is currently running in Sandbox mode and will NOT process any actual payments. | <a href="%s">%s</a>
pl_pl: System płatności online WooCommerce Blue Media działa obecnie w trybie testowym i NIE będzie przetwarzał żadnych faktycznych płatności. | <a href="%s">%s</a>

source: WooCommerce Blue Media Online Payment System requires WooCommerce plugin to work normally. Please activate it or <a href="http://wordpress.org/plugins/woocommerce/" target="_blank">install it</a>. | <a href="%s">%s</a>
pl_pl: System płatności online Blue Media wymaga wtyczki WooCommerce. Aktywuj ją lub <a href="http://wordpress.org/plugins/woocommerce/" target="_blank">zainstaluj</a>. | <a href="%s">% s </a>

source: Please save the plug-in configuration with the specified serviceID and hash key.
pl_pl: Proszę zapisać konfigurację wtyczki z podanym serviceID oraz kluczem współdzielonym.

source: Settings
pl_pl: Ustawienia

source: In the case of an installment payment, the minimum order amount should be higher than 100
pl_pl: W przypadku płatności ratalnej, minimalna kwota zamówienia powinna być wyższa niż 100

source: The amount may not be less than 2
pl_pl: Kwota nie może być mniejsza niż 2.

source: Please insert BLIK code.
pl_pl: Proszę wprowadzić kod BLIK

source: Please enter your Google Pay details
pl_pl: Proszę wprowadzić dane Google Pay

source: BLIK payment
pl_pl: Płatność BLIK

source: Installments
pl_pl: Płatność ratalna

source: Pay via Blue Media online payment system
pl_pl: System płatności online Blue Media

source: Payment in installments
pl_pl: Płatność poprzez system ratalny

source: Awaiting payment
pl_pl: Oczekiwanie na zapłatę

source: Order received
pl_pl: Zamówienie przyjęte

source: BLIK
pl_pl: BLIK 0

source: Let your customers pay with BLIK on your store's website
pl_pl: Płatność poprzez system płatności BLIK 0

source: Please enter your e-mail address.
pl_pl: Proszę wprowadzić adres e-mail.

source: Confirm the operation in your banking application.
pl_pl: Potwierdź operację w aplikacji swojego banku.

source: Payment has been successfully completed.
pl_pl: Płatność została zakończona pomyślnie.

source: The provided code is invalid.
pl_pl: Wprowadzony kod nie jest prawidłowy.

source: Your transaction has already been paid.
pl_pl: Twoja transakcja BLIK została już opłacona.

source: The BLIK code has timed out.
pl_pl: Kod blik wygasł.

source: An error occurred while connecting to the server. Please enter the BLIK code again. If the situation persists, please contact bluemedia and provide the transaction number: %d
pl_pl: Wystąpił błąd podczas połączenia z serwerem. Prosimy o ponowne wpisanie kodu BLIK. Jeżeli sytuacja będzie się powtarzać prosimy o kontakt z firmą BlueMedia oraz podanie nr transakcji: %s.

source: Blue Media online payment system
pl_pl: System płatności online Blue Media

source: All payment forms (BLIK, payment cards, PBL and others)
pl_pl: Wszystkie formy płatności (BLIK, Karty płatnicze, PBL i inne)

source: Start the payment
pl_pl: Rozpocznij płatność

source: Payment failed
pl_pl: Płatność nie powiodła się

source: Payment via Blue Media online payment system with Google Pay
pl_pl: Płatność poprzez System płatności online Blue Media z Google Pay

source: Buy now, pay later
pl_pl: System płatności online Blue Media

source: Pay via Smartney online payment system
pl_pl: Płatność poprzez system płatności Smartney

source: Card payment
pl_pl: Płatność kartą

source: Accept card payment
pl_pl: Płatność za pomocą karty płatniczej

source: BLIK payment with redirection to the BLIK processor system
pl_pl: Płatność poprzez system BLIK z przekierowaniem do systemu procesora BLIK

source: Pay via Blue Media BLIK online payment system
pl_pl: Zapłać poprzez System płatności online Blue Media z użyciem BLIK.

source: On/Off
pl_pl: Włącz/Wyłącz

source: Turn on the Blue Media online payment system
pl_pl: Włącz System płatności online Blue Media.

source: Register an account in the Blue Media system
pl_pl: Zarejestruj konto w systemie Blue Media

source: Off
pl_pl: Wyłączony

source: On
pl_pl: Włączony

source: Title
pl_pl: Tytuł

source: The title that the Store user sees
pl_pl: Tytuł, który widzi użytkownik Sklepu.

source: Description
pl_pl: Opis

source: Description of the gateway that the user sees when creating the order
pl_pl: Opis bramki, który widzi użytkownik przy tworzeniu zamówienia

source: Pay via Blue Media online payment system: payment by credit card, online bank transfer or fast bank transfer
pl_pl: Zapłać poprzez System płatności online Blue Media: płatność kartą płatniczą, przelewem bankowym on-line lub szybkim przelewem bankowym.

source: Blue Media online payment system domain
pl_pl: Domena Systemu płatności online Blue Media

source: When testing, enter: pay-accept.bm.pl; when you want to work in production: pay.bm.pl
pl_pl: Gdy testujesz wpisz: pay-accept.bm.pl; gdy chcesz pracować produkcyjnie: pay.bm.pl

source: Payment pending status
pl_pl: Status oczekiwania na płatność

source: Payment pending status determines the manner of reserving the goods
pl_pl: Status oczekiwania na płatność określa sposób rezerwacji towaru

source: Pending payment - Order received, payment has not started. Pending payment (unpaid)
pl_pl: Pending payment - Otrzymane zamówienie, nie rozpoczęto płatności. Oczekiwanie na płatność (niezapłacone)

source: On-Hold - Waiting for payment - stock level is reduced, but you must confirm the payment
pl_pl: On-Hold - Oczekiwanie na płatność - zapasy są zmniejszone, ale musisz potwierdzić płatność.

source: Currency Settings
pl_pl: Ustawienia walut

source: ServiceID received from Blue Media
pl_pl: ServiceID (ID usługi) otrzymane od Blue Media

source: Hash key
pl_pl: Klucz współdzielony

source: The key to hash data received from Blue Media
pl_pl: Klucz współdzielony otrzymany od Blue Media

source: Hash encryption method
pl_pl: Metoda szyfrowania hash

source: BLIK PBL payment
pl_pl: Płatność BLIK PBL

source: Payment displayed as a separate radio button on the Store's website with redirection to the BLIK processor
pl_pl: Płatność wyświetlana jako osobny radio button na stronie Sklepu z przekierowaniem do procesora BLIK.

source: BLIK payment 0
pl_pl: Płatność BLIK 0

source: Payment displayed as a separate radio button on the Store's website with the BLIK processor form
pl_pl: Płatność wyświetlana jako osobny radiobutton na stronie Sklepu z przekierowaniem do procesora BLIK.

source: Payment by card displayed as a separate radio button on the Store's website
pl_pl: Płatność kartą wyświetlana jako osobny radio button na stronie Sklepu

source: Installment payment
pl_pl: Płatność Ratalna

source: Installment payment displayed as a separate radio button on the Store's website
pl_pl: Płatność ratalna wyświetlana jako osobny radio button na stronie Sklepu

source: Smartney payment
pl_pl: Płatność Smartney

source: Deferred Payment - Buy now and pay within 30 days. Option button Visible as a separate one on the store's page.
pl_pl: Płatność odroczona - Kup teraz, a zapłać nawet w ciągu 30 dni. Widoczna jako osobny radio button na stronie sklepu.

source: Background payments
pl_pl: Płatności w tle

source: No
pl_pl: Nie

source: Yes
pl_pl: Tak

source: Choosing "yes" means that the customer is not redirected to the Blue Media payment page, instead remaining in the store’s website where different payment options are displayed.<br><br> Choosing "no" redirects the customer back to the Blue Media payment page.
pl_pl: Ustawienie na "tak" sprawia, że klient nie zostaje przekierowany na stronę płatności Blue Media, pozostaje na stronie sklepu, gdzie wyświetlają się różne opcje płatności.<br/><br/> Ustawienie na "nie" skutkuje przekierowaniem na stronę płatności Blue Media.

source: Fetch / update channels
pl_pl: Pobierz / aktualizuj kanały

source: Downloading...
pl_pl: Pobieranie...

source: If "Payments in the background" are enabled, the available payment options will appear here.
pl_pl: Przy włączonych "Płatnościach w tle" pojawią się tu dostępne opcje płatności

source: Custom sorting of payment
pl_pl: Własne sortowanie kanałów płatności

source: Please save the plug-in configuration with the specified serviceID and hash key
pl_pl: Proszę zapisać konfigurację wtyczki z podanym serviceID oraz kluczem współdzielonym

source: The payment order is submitted to your bank via Blue Media S.A. based in Sopot and will be processed in accordance with the terms and conditions specified by your bank. Having selected the bank, the payment will be authorised.
pl_pl: Zlecenie płatnicze składane jest do Twojego banku za pośrednictwem Blue Media S.A. z siedzibą w Sopocie i zostanie zrealizowane zgodnie z warunkami określonymi przez Twój bank. Po wyborze banku dokonasz autoryzacji płatności.

source: Blue Media online payment system for WooCommerce
pl_pl: System płatności online Blue Media dla WooCommerce

source: Easily enable Blue Media Payment Gateway with WooCommerce
pl_pl: W prosty sposób dodaj opcję płatności Blue Media z wtyczką WooCommerce

source: We are waiting for payment. If you have interrupted it for any reason, please order it again.
pl_pl: Oczekujemy na płatność. Jeżeli z jakichś przyczyn ją przerwałeś – zleć ją ponownie.

source: Order status
pl_pl: Status Twojego zamówienia

source: Payment in progress
pl_pl: Płatność w trakcie realizacji

source: pending
pl_pl: Płatność w trakcie realizacji
